In [1]:
import pandas as pd
import numpy as np

### Selecionando dados

In [2]:
np.random.seed(7)
sample = pd.DataFrame({'A': np.random.randint(1, 100, 5),
                       'B': np.random.randint(1, 1_000, 5),
                       'C': np.random.randint(500, 2_000, 5)
                      },
                     index = ['a', 'b', 'c', 'd', 'e'])

In [3]:
sample

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054
e  84  399  1230

.iloc[]: seleciona valores pelo índice.

Sintaxe: `data_frame.iloc[linha, coluna]`

In [4]:
# todas as linhas da coluna de posição 0
sample.iloc[:, 0]

a    48
b    69
c    26
d    68
e    84
Name: A, dtype: int64

In [5]:
sample

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054
e  84  399  1230

In [7]:
# valores entre 'a' e 'd'
sample.iloc[:4, :]

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054

In [8]:
# valores das linhas 'a' até 'c', para a coluna de posição 0
sample.iloc[:3, 0]

a    48
b    69
c    26
Name: A, dtype: int64

In [9]:
# valores das linhas 'b' até 'd', para a colunas de posição 0 e 1
sample.iloc[1:4, [0, 1]]

    A    B
b  69  616
c  26  349
d  68  186

In [10]:
# valores a partir da coluna 'c', colunas de posição [0 e 2]
sample.iloc[2:, [0, 2]]

    A     C
c  26   866
d  68  1054
e  84  1230

.loc[]: seleciona valores pelo label.

Sintaxe: `data_frame.loc[linha, coluna]`

In [11]:
sample

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054
e  84  399  1230

In [12]:
# todas as linhas da coluna A
sample.loc[:,'A']

a    48
b    69
c    26
d    68
e    84
Name: A, dtype: int64

In [13]:
# valores entre 'a' e 'd'
sample.loc['a':'d', :]

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054

In [14]:
# valores das linhas 'a' até 'c', para a coluna A
sample.loc['a':'c', 'A']

a    48
b    69
c    26
Name: A, dtype: int64

In [15]:
# valores das linhas 'b' até 'd', para a colunas A e B
sample.loc['b':'d', ['A', 'B']]

    A    B
b  69  616
c  26  349
d  68  186

In [16]:
# valores a partir da linha 'c', colunas de posição [0 e 2] - 'A' e 'C'
sample.loc['c':, ['A', 'C']]

    A     C
c  26   866
d  68  1054
e  84  1230

In [17]:
# seleciona todas as colunas da última linha
sample.iloc[-1:, ]

    A    B     C
e  84  399  1230

In [18]:
# seleciona todas as colunas das duas últimas linhas
sample.iloc[-2:, ]

    A    B     C
d  68  186  1054
e  84  399  1230

In [19]:
# todos os valores da última coluna
sample.iloc[:, -1]

a    1035
b     845
c     866
d    1054
e    1230
Name: C, dtype: int64

Selecionando apenas um valor:

In [20]:
sample

    A    B     C
a  48  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054
e  84  399  1230

In [21]:
sample.at['a', 'A']

48

In [22]:
# altera o valor
sample.at['a', 'A'] = 50

In [23]:
sample

    A    B     C
a  50  920  1035
b  69  616   845
c  26  349   866
d  68  186  1054
e  84  399  1230

In [24]:
sample.iat[0, 0]

50

In [25]:
sample.iat[3, 1]

186